In [1]:
import pandas as pd

In [2]:
people = [
    ["Shakil", 27, "Munich"],
    ["ABC", 25, "Berlin"],
    ["DEF", 30, "Hamburg"],
    ["JKL", 35, "Munich"]
]

In [3]:
people

[['Shakil', 27, 'Munich'],
 ['ABC', 25, 'Berlin'],
 ['DEF', 30, 'Hamburg'],
 ['JKL', 35, 'Munich']]

In [4]:
df = pd.DataFrame(people)

In [5]:
df

        0   1        2
0  Shakil  27   Munich
1     ABC  25   Berlin
2     DEF  30  Hamburg
3     JKL  35   Munich

In [6]:
df = pd.DataFrame(people, columns=['name','age','city'])
df

     name  age     city
0  Shakil   27   Munich
1     ABC   25   Berlin
2     DEF   30  Hamburg
3     JKL   35   Munich